tests/Fixtures/PaymentTest/search.json

{
    "current_page": 1,
    "data": [
        {
            "id": 1,
            "user_id": 4,
            "plan_id": 1,
            "payment_id": "22d6d597-000f-5000-9000-145f6df21d88",
            "status": "pending",
            "is_paid": 0,
            "amount": "200.00",
            "currency": "RUB",
            "description": "payment desc",
            "started_at": "2018-07-10 14:27:54",
            "created_at": "2018-07-10 14:27:54",
            "updated_at": "2018-07-10 14:27:54",
            "user": {
                "id": 4,
                "name": "Megan Griffin",
                "email": "megan.griffin@example.net",
                "reset_token": null,
                "role_id": 2,
                "questionnaires_count": 20,
                "points": 100,
                "is_active": 1,
                "created_at": "2018-12-02 16:00:00",
                "updated_at": "2018-12-01 16:00:00"
            },
            "plan": {
                "id": 1,
                "name": "light",
                "description": [
                    "line 1",
                    "line 2"
                ],
                "price": "200.00",
                "points": 100,
                "is_active": 1
            }
        }
    ],
    "first_page_url": "http:\/\/localhost\/payments?page=1",
    "from": 1,
    "last_page": 1,
    "last_page_url": "http:\/\/localhost\/payments?page=1",
    "next_page_url": null,
    "path": "http:\/\/localhost\/payments",
    "per_page": 15,
    "prev_page_url": null,
    "to": 1,
    "total": 1
}
